---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.ConceptualConstructionOpeningType.InvalidOpeningTypeConstruction
enum: Autodesk.Revit.DB.Analysis.ConceptualConstructionOpeningType
source: html/562a88f7-3d67-367e-63a1-ac4e7ec3b884.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionOpeningType.InvalidOpeningTypeConstruction

Invalid value/not set Opening Type Construction